{"Please enter {0} words or less.":"Vui lòng nhập {0} từ hoặc ít hơn.","Please enter at least {0} words.":"Vui lòng nhập ít nhất {0} từ.","Please enter between {0} and {1} words.":"Vui lòng nhập giữa {0} và {1} từ.","Letters or punctuation only please":"Xin vui lòng chỉ dùng Chữ cái hoặc các dấu chấm câu","Letters, numbers, spaces or underscores only please":"Xin vui lòng chỉ dùng Chữ cái, số, dấu cách trống hoặc gạch chân","Letters only please":"Xin vui lòng chỉ dùng Chữ cái","No white space please":"Xin vui lòng Không dùng cách trống","Your ZIP-code must be in the range 902xx-xxxx to 905-xx-xxxx":"Mã vùng của bạn phải ở trong phạm vi 902xx-xxxx đến 905-xx-xxxx","A positive or negative non-decimal number please":"Xin vui lòng nhập Một số không có phần thập phân âm hoặc dương","The specified vehicle identification number (VIN) is invalid.":"Số nhận dạng đã chỉ định phương tiện (VIN) là không hợp lệ.","Please enter a correct date":"Vui lòng nhập đúng ngày","Please enter a valid time, between 00:00 and 23:59":"Vui lòng nhập một thời gian hợp lệ, từ 00:00 đến 23:59","Please enter a valid time, between 00:00 am and 12:00 pm":"Vui lòng nhập một thời gian hợp lệ, từ 00:00 am đến 12:00 pm","Please specify a valid phone number":"Hãy chỉ định số điện thoại hợp lệ","Please specify a valid mobile number":"Hãy chỉ ra một số điện thoại di động hợp lệ","Please enter at least {0} characters":"Vui lòng nhập ít nhất {0} ký tự","Please enter a valid credit card number.":"Vui lòng nhập một số thẻ tín dụng hợp lệ.","Please enter a valid IP v4 address.":"Vui lòng nhập một địa chỉ IP v4 hợp lệ.","Please enter a valid IP v6 address.":"Vui lòng nhập một địa chỉ IP v6 hợp lệ.","Invalid format.":"Định dạng không hợp lệ.","HTML tags are not allowed.":"Thẻ HTML không được phép.","Please select an option.":"Xin vui lòng chọn một tùy chọn.","Empty Value.":"Giá trị trống.","Please use only letters (a-z or A-Z), numbers (0-9) or spaces only in this field.":"Vui lòng chỉ dùng các ký tự (a-z or A-Z), số (0-9) hoặc dấu cách trong vùng này.","Please use only letters (a-z or A-Z), numbers (0-9) or underscore (_) in this field, and the first character should be a letter.":"Xin vui lòng sử dụng chỉ chữ cái (a-z or A-Z), số (0-9) hoặc gạch chân(_) trong trường này, ký tự đầu tiên nên là một chữ cái.","Please use only letters (a-z or A-Z), numbers (0-9), spaces and \"#\" in this field.":"Xin vui lòng chỉ sử dụng chữ cái (a-z hoặc A-Z), số (0-9), cách trống và \"#\" trong trường này.","Please enter a valid phone number. For example (123) 456-7890 or 123-456-7890.":"Vui lòng nhập một số điện thoại hợp lệ. ví dụ: (123) 456-7890 hoặc 123-456-7890.","Please enter a valid fax number (Ex: 123-456-7890).":"Vui lòng nhập một số fax hợp lệ (ví dụ: 123-456-7890).","Please enter a valid email address (Ex: johndoe@domain.com).":"Vui lòng nhập một địa chỉ email hợp lệ (ví dụ: johndoe@domain.com).","Please enter 6 or more characters. Leading and trailing spaces will be ignored.":"Vui lòng nhập 6 kí tự trở lên. Hàng đầu và chuỗi dấu cách sẽ bị bỏ qua.","Please enter 7 or more characters, using both numeric and alphabetic.":"Xin vui lòng nhập 7 ký tự hoặc nhiều hơn, bằng cách sử dụng cả số và chữ.","Please enter a valid URL. Protocol is required (http:\/\/, https:\/\/ or ftp:\/\/).":"Vui lòng nhập một URL hợp lệ. Giao thức là bắt buộc (http:\/\/, https:\/\/ hoặc ftp: \/ \/).","Please enter a valid URL. For example http:\/\/www.example.com or www.example.com.":"Vui lòng nhập một URL hợp lệ. ví dụ http:\/\/www.example.com hoặc www.example.com.","Please enter a valid XML-identifier (Ex: something_1, block5, id-4).":"Vui lòng nhập một nhận dạng XML hợp lệ (ví dụ: something_1, block5, id-4).","Please enter a valid social security number (Ex: 123-45-6789).":"Vui lòng nhập một số an sinh xã hội hợp lệ (ví dụ: 123-45-6789).","Please enter a valid zip code (Ex: 90602 or 90602-1234).":"Vui lòng nhập mã zip hợp lệ (ví dụ: 90602 hoặc 90602-1234).","Please use this date format: dd\/mm\/yyyy. For example 17\/03\/2006 for the 17th of March, 2006.":"Xin vui lòng sử dụng định dạng ngày tháng này: dd\/mm\/yyyy. Ví dụ: 17\/03\/2006 cho 17 Tháng ba, 2006.","Please enter a valid $ amount. For example $100.00.":"Vui lòng nhập một số tiền hợp lệ. Ví dụ: 100,00 $.","Please enter a number 0 or greater in this field.":"Hãy điền một số lớn hơn hoặc bằng 0 vào trường này.","Please enter a number greater than 0 in this field.":"Vui lòng nhập một số lớn hơn 0 trong trường này.","Please input a valid CSS-length (Ex: 100px, 77pt, 20em, .5ex or 50%).":"Hãy nhập vào CSS hợp lệ, chiều dài (ví dụ: 100px, 77pt, 20em, .5ex hoặc 50%).","Please enter a valid number in this field.":"Vui lòng nhập một số hợp lệ trong lĩnh vực này.","The value is not within the specified range.":"Giá trị không phải là trong phạm vi được chỉ định.","Please use letters only (a-z or A-Z) in this field.":"Xin vui lòng chỉ sử dụng chữ cái (a-z hoặc A-Z) trong trường này.","Please use only letters (a-z), numbers (0-9) or underscore (_) in this field, and the first character should be a letter.":"Xin vui lòng sử dụng chỉ chữ cái (a-z), số (0-9) hoặc gạch chân(_) trong trường này, ký tự đầu tiên nên là một chữ cái.","Please use only letters (a-z or A-Z) or numbers (0-9) in this field. No spaces or other characters are allowed.":"Xin vui lòng chỉ sử dụng chữ cái (a-z hoặc A-Z) hoặc số (0-9) trong trường này. Không có dấu cách hoặc ký tự khác được cho phép.","Please enter a valid date.":"Vui lòng nhập ngày hợp lệ.","Make sure the To Date is later than or the same as the From Date.":"Đảm bảo Ngày Đến muộn hơn hoặc tương tự như Ngày Bắt Đầu.","Please make sure your passwords match.":"Hãy chắc chắn rằng mật khẩu của bạn phù hợp.","Please enter a valid URL Key (Ex: \"example-page\", \"example-page.html\" or \"anotherlevel\/example-page\").":"Vui lòng nhập một URL key hợp lệ (ví dụ: \"trang ví dụ\", \"ví dụ-page.html\" hoặc \"anotherlevel\/ví dụ-trang\").","Please enter a valid zip code.":"Vui lòng nhập mã zip hợp lệ.","Please select State\/Province.":"Vui lòng chọn tiểu bang\/tỉnh.","This is a required field.":"Đây là trường bắt buộc.","Please enter a valid credit card verification number.":"Vui lòng nhập một số xác minh thẻ tín dụng hợp lệ.","Please enter issue number or start date for switch\/solo card type.":"Hãy nhập số hoặc ngày bắt đầu cho loại thẻ switch\/solo.","Please enter positive number in this field.":"Vui lòng nhập số dương trong trường này.","Please enter a valid value, ex: 10,20,30":"Vui lòng nhập một giá trị hợp lệ, ví dụ: 10,20,30","Please enter a valid email address.":"Vui lòng nhập một địa chỉ email hợp lệ.","Please enter a value less than or equal to {0}.":"Vui lòng nhập một giá trị ít hơn hoặc bằng với {0}.","Please enter a value greater than or equal to {0}.":"Vui lòng nhập một giá trị lớn hơn hoặc bằng {0}.","Submit":"Gửi","Close":"Đóng lại","more":"thêm","Save":"Lưu","Ok":"đồng ý","Please specify the quantity of product(s).":"Hãy chỉ ra số lượng sản phẩm.","No records found.":"Không tìm thấy bản ghi nào.","Next":"Tiếp theo","Previous":"Trước","Add":"Thêm","Please enter more or equal than {0} symbols.":"Vui lòng nhập nhiều hơn hoặc bằng {0} biểu tượng.","Please enter less or equal than {0} symbols.":"Vui lòng nhập ít hơn hoặc bằng {0} biểu tượng.","We don't recognize or support this file extension type.":"Chúng tôi không nhận diện được hoặc định dạng tập tin không được hỗ trợ.","File you are trying to upload exceeds maximum file size limit.":"Tệp bạn đang cố gắng để tải lên vượt quá giới hạn kích thước tệp tối đa.","Please use tag SCRIPT with SRC attribute or with proper content to include JavaScript to the document.":"Xin vui lòng sử dụng thẻ SCRIPT với thuộc tính SRC hoặc với đúng nội dung để bao gồm JavaScript cho tài liệu.","The date is not within the specified range.":"Ngày không phải là trong phạm vi được chỉ định.","Select Date":"Chọn ngày","OK":"Đồng ý","Attention":"Chú ý","Something went wrong.":"Đã xảy ra lỗi.","Search by keyword":"Tìm kiếm theo từ khóa","Keyword":"Từ khoá","${ $.visible } out of ${ $.total } visible":"{ $.visible } $ trong số ${ $.total } có thể nhìn thấy","New View":"Xem kiểu mới","Default View":"Xem kiểu mặc định","On":"Bật","Off":"Tắt","Select All":"Chọn tất cả","Deselect All":"Bỏ chọn tất cả","Select All on This Page":"Chọn tất cả trên Trang này","Deselect All on This Page":"Bỏ chọn tất cả trên Trang này","Go to Details Page":"Đi tới trang chi tiết","You have successfully saved your edits.":"Bạn đã lưu các chỉnh sửa thành công.","Done":"Đã thực hiện","options":"tùy chọn","Select...":"Chọn...","Selected":"Đã được chọn","Yes":"Có","No":"Không","Adding...":"Đang thêm...","Added":"Nhập","Add to Cart":"Thêm vào giỏ hàng","select all":"chọn tất cả","unselect all":"bỏ chọn tất cả","Are you sure you want to remove this item from your Compare Products list?":"Bạn có chắc bạn muốn xoá nó này khỏi danh sách so sánh sản phẩm của bạn không?","Are you sure you want to remove all items from your Compare Products list?":"Bạn có chắc bạn muốn xoá nó khỏi danh sách so sánh sản phẩm của bạn không?","Are you sure you want to delete this address?":"Bạn có chắc bạn muốn xóa địa chỉ này?","No Password":"Không có mật khẩu","Weak":"Yếu kém","Medium":"Trung bình","Strong":"Mạnh mẽ","Very Strong":"Rất mạnh","Guest checkout is disabled.":"Thanh toán như khách đã bị tắt.","Your coupon was successfully applied.":"Phiếu mua hàng của bạn được áp dụng thành công.","Your coupon was successfully removed.":"Phiếu mua hàng của bạn đã được loại bỏ thành công.","Provided Zip\/Postal Code seems to be invalid.":"Mã Zip\/bưu điện được cung cấp dường như không hợp lệ.","If you believe it is the right one you can ignore this notice.":"Nếu bạn tin rằng nó là đúng, bạn có thể bỏ qua thông báo này.","Payment Method":"Phương thức thanh toán","Are you sure you would like to remove this item from the shopping cart?":"Bạn có chắc bạn muốn loại bỏ sản phẩm này khỏi giỏ mua hàng?","Shipping":"Vận chuyển","Save Address":"Lưu địa chỉ","New Address":"Địa chỉ mới","Review & Payments":"đánh giá và thanh toán","Select a new payment method":"Chọn một phương thức thanh toán mới","Card Verification Number Visual Reference":"Hình ảnh xác minh số thẻ","Delete":"Xóa","Sorry, something went wrong.":"Xin lỗi, có gì đó đã đi sai.","Sorry, something went wrong. Please try again later.":"Xin lỗi, có gì đó đã đi sai. Xin vui lòng thử lại sau.","We can't complete your order because you don't have a payment method set up.":"Chúng tôi không thể hoàn thành đơn đặt hàng của bạn bởi vì bạn chưa thiết lập phương thức thanh toán nào.","Please choose a payment method.":"Chọn một phương thức thanh toán.","Sorry, but something went wrong. Please contact the seller.":"Xin lỗi, nhưng có gì đó đã đi sai. Xin vui lòng liên hệ với dịch vụ khách hàng của PayPal.","Changes have been made to this section that have not been saved.":"Những thay đổi đã được thực hiện cho phần này không được lưu.","records found":"bản ghi đã được tìm thấy","selected":"Đã chọn","Actions":"Thao tác","Select Items":"Chọn sản phẩm","Export":"Xuất","We couldn't find any records.":"Không có kết quả tìm kiếm.","Search":"Tìm kiếm","Filters":"Bộ lọc","Remove":"Hủy bỏ","Reset":"Thiết lập lại","Edit":"Chỉnh sửa","Options":"Tùy chọn","Assign":"Chỉ định","Apply":"Áp dụng","of":"của","Custom":"Tùy chỉnh","per page":"mỗi trang","This tab contains invalid data. Please resolve this before saving.":"Tab này chứa dữ liệu không hợp lệ. Xin vui lòng giải quyết điều này trước khi tiết kiệm.","Delete image":"Xóa hình","Use Default Value":"Sử dụng giá trị mặc định","Incl. Tax":"Đã bao gồm thuế","Excl. Tax":"Chưa bao gồm thuế","Creating an account has many benefits:":"Tạo một tài khoản có nhiều lợi ích:","See order and shipping status":"Xem trạng thái đơn đặt hàng và vận chuyển","Track order history":"Theo dõi lịch sử đặt hàng","Check out faster":"Kiểm tra nhanh hơn","Create an Account":"Tạo tài khoản","Email Address":"Địa chỉ email","Password":"Mật khẩu","Sign In":"Đăng nhập","Forgot Your Password?":"Bạn quên mật khẩu?","or":"hoặc","* Required Fields":"* Bắt buộc","Apply Discount Code":"Áp dụng mã giảm giá","Enter discount code":"Nhập mã giảm giá","Apply Discount":"Áp dụng giảm giá","Cancel coupon":"Hủy bỏ phiếu giảm giá","See our Shipping Policy":"Xem chính sách vận chuyển của chúng tôi","Order Summary":"Tóm tắt đơn hàng","Payment Information":"Thông tin thanh toán","No Payment method available.":"Không có phương thức thanh toán có sẵn.","My billing and shipping address are the same":"Địa chỉ thanh toán và giao hàng của tôi giống nhau","Update":"Cập nhật","Ship To:":"Gửi đến:","edit":"sửa","Shipping Method:":"Phương thức vận chuyển:","Shipping Address":"Địa chỉ giao hàng","Shipping Methods":"Phương thức vận chuyển","Price":"Giá","Estimated Total":"Ước tính tổng số","You can track your order status by creating an account.":"Bạn có thể theo dõi tình trạng đơn hàng của bạn bằng cách tạo một tài khoản.","A letter with further instructions will be sent to your email.":"Một bức thư với hướng dẫn thêm sẽ được gửi tới email của bạn.","Save in address book":"Lưu vào sổ địa chỉ","My Cart":"Giỏ hàng của tôi","Items in Cart":"Sản phẩm trong giỏ","You have no items in your shopping cart.":"Bạn có không có sản phẩm nào trong giỏ hàng của bạn.","Cart Subtotal":"Tổng phụ giỏ hàng","See Details":"Xem chi tiết","Options Details":"Tùy chọn chi tiết","See price before order confirmation.":"Xem giá trước khi xác nhận đặt hàng.","Qty":"Số lượng","Remove item":"Xóa sản phẩm","No Payment Methods":"Không có phương thức thanh toán","Estimate Tax":"Ước tính thuế","Estimate Shipping and Tax":"ước tính vận chuyển và thuế","Total":"Tổng","Place Order":"Đặt hàng","Forgot an Item?":"Quên một sản phẩm?","Edit Your Cart":"Sửa giỏ hàng của bạn","View and Edit Cart":"Xem và sửa giỏ hàng","View Details":"Xem chi tiết","You can create an account after checkout.":"Bạn có thể tạo một tài khoản sau khi thanh toán.","You already have an account with us. Sign in or continue as guest.":"Bạn đã có một tài khoản trên hệ thống của chúng tôi. Đăng nhập hoặc tiếp tục như là khách.","Login":"Đăng nhập","Credit Card Information":"Thông tin thẻ tín dụng","Credit Card Number":"Số thẻ tín dụng","Expiration Date":"Ngày hết hạn","Card Verification Number":"Số xác minh thẻ","What is this?":"Đây là gì?","Month":"Tháng","Year":"Năm","Gift options":"Tùy chọn Quà tặng","Message:":"Tin nhắn:","Gift Message (optional)":"Quà tặng tin nhắn (tùy chọn)","To:":"Đến:","From:":"Từ:","Order total will be displayed before you submit the order":"Tất cả các đơn đặt hàng sẽ được hiển thị trước khi bạn gửi đơn đặt hàng","ending":"kết thúc","expires":"hết hạn","What is PayPal?":"PayPal là gì?","You will be redirected to the PayPal website.":"Bạn sẽ được chuyển hướng đến trang web PayPal.","Continue to PayPal":"Tiếp tục đến PayPal","Acceptance Mark":"Đánh dấu chấp nhận","See terms":"Xem điều khoản","You will be redirected to the PayPal website when you place an order.":"Bạn sẽ được chuyển hướng đến trang web PayPal khi bạn đặt một đơn đặt hàng.","Save credit card information for future use.":"Lưu thông tin thẻ tín dụng để sử dụng trong tương lai.","Continue":"Tiếp tục","Please do not refresh the page until you complete payment.":"Xin vui lòng không làm mới trang cho đến khi bạn hoàn thành thanh toán.","-- Please Select Billing Agreement--":"--Vui lòng chọn thanh toán hợp đồng--","Sign a billing agreement to streamline further purchases with PayPal.":"Đăng ký một thỏa thuận thanh toán để hợp lí hóa những thanh toán về sau với PayPal.","Remember Me":"Ghi nhớ tôi","What's this?":"Đây là gì?","Check 'Remember Me' to access your shopping cart on this computer even if you are not signed in.":"Kiểm tra 'ghi nhớ tôi' để truy cập vào giỏ hàng của bạn trên máy tính này ngay cả khi bạn không đăng nhập.","Purchase Order Number":"Số đơn hàng được thanh toán","Make Check payable to:":"Thực hiện kiểm tra phải trả cho:","Send Check to:":"Gửi kiểm tra đến:","Reload captcha":"Tải lại captcha","Attention: Captcha is case sensitive.":"Chú ý: Các Captcha là trường hợp nhạy cảm."}